<a href="https://colab.research.google.com/github/kumbhat10/Data_Science_in_Python/blob/master/Learning_Pandas/Indexing_in_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# **Indexing in Pandas**

In [0]:
import pandas as pd
Housing_Test = pd.read_csv('/content/sample_data/california_housing_test.csv')
Housing_Test

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

## **Index based selection**

Pandas indexing works in 1 of the 2 paradigms.
The first is Index-based selection :
Selecting data based on its numerical position in the data.
iloc follows this paradigm

In [0]:
Housing_Test.iloc[0]   ## all the details for 0th row

longitude               -122.0500
latitude                  37.3700
housing_median_age        27.0000
total_rooms             3885.0000
total_bedrooms           661.0000
population              1537.0000
households               606.0000
median_income              6.6085
median_house_value    344700.0000
Name: 0, dtype: float64

In [0]:
Housing_Test.iloc[:,0]  ## all the first columns . Notice the name is longitude

0      -122.05
1      -118.30
2      -117.81
3      -118.36
4      -119.67
         ...
2995   -119.86
2996   -118.14
2997   -119.70
2998   -117.12
2999   -119.63
Name: longitude, Length: 3000, dtype: float64

In [0]:
Housing_Test.iloc[:3,0]   ## first 3 rows of 1st column

0   -122.05
1   -118.30
2   -117.81
Name: longitude, dtype: float64

In [0]:
Housing_Test.iloc[:3,:4]  ## first 3 rows and first 4 columns

   longitude  latitude  housing_median_age  total_rooms
0    -122.05     37.37                27.0       3885.0
1    -118.30     34.26                43.0       1510.0
2    -117.81     33.78                27.0       3589.0

In [0]:
Housing_Test.iloc[3:,0]### from 3rd to end of first column

3      -118.36
4      -119.67
5      -119.56
6      -121.43
7      -120.65
         ...
2995   -119.86
2996   -118.14
2997   -119.70
2998   -117.12
2999   -119.63
Name: longitude, Length: 2997, dtype: float64

In [0]:
Housing_Test.iloc[-5:,0]   # last 5 rows of first column

2995   -119.86
2996   -118.14
2997   -119.70
2998   -117.12
2999   -119.63
Name: longitude, dtype: float64

In [0]:
Housing_Test.iloc[-5:]  ## last 5 rows of table

      longitude  latitude  ...  median_income  median_house_value
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[5 rows x 9 columns]

## **Label Based Selection**

The second paradigm for attribute is the one followed by the loc operator : label based selection 
In this paradigm , its the data index value , not its position, which matters

In [0]:
reviews = pd.DataFrame({'Bob':['I liked it.','It was awful.','I liked it.','It was awful.'],'Sue':['Pretty Good','Bland','I liked it.','It was awful.']},index=['Product A','Product B','Product C','Product D'])
reviews

                     Bob            Sue
Product A    I liked it.    Pretty Good
Product B  It was awful.          Bland
Product C    I liked it.    I liked it.
Product D  It was awful.  It was awful.

In [0]:
reviews.loc['Product B']

Bob    It was awful.
Sue            Bland
Name: Product B, dtype: object

In [0]:
reviews.loc['Product B','Bob']

'It was awful.'

In [0]:
reviews.loc[:,'Bob']

Product A      I liked it.
Product B    It was awful.
Product C      I liked it.
Product D    It was awful.
Name: Bob, dtype: object

iloc uses the python stdlib indexing scheme, where 1st = incuded and last = excluded

**for example 0:10 will select 0,1,2...9**

loc indexes inclusively . So,

**0:10 will select 0,1,2....10**

## **Manipulating the index**

## **set_index()**

In [0]:
rev_newIndex = reviews.set_index('Bob')   ## bob becomes index now
rev_newIndex

                         Sue
Bob
I liked it.      Pretty Good
It was awful.          Bland
I liked it.      I liked it.
It was awful.  It was awful.

In [0]:
rev_newIndex.loc['I liked it.']

                     Sue
Bob
I liked it.  Pretty Good
I liked it.  I liked it.

## Conditional Selection

In [0]:
reviews = pd.DataFrame({'Bob':['I liked it.','It was awful.','I liked it.','It was awful.'],'Sue':['Pretty Good','Bland','I liked it.','It was awful.']},index=['Product A','Product B','Product C','Product D'])
a = reviews.Bob == 'I liked it.'
a

Product A     True
Product B    False
Product C     True
Product D    False
Name: Bob, dtype: bool

In [0]:
reviews.Sue[reviews.Bob=='I liked it.']  ## also other AND &  and OR | conditions can be added

Product A    Pretty Good
Product C    I liked it.
Name: Sue, dtype: object

**Pandas comes with a few built-in conditional selectors, two of which we will highlight here**

## **isin**

In [0]:
reviews.Sue[reviews.Bob.isin(['I liked it.'])] ## same as above

Product A    Pretty Good
Product C    I liked it.
Name: Sue, dtype: object

## **isnull**

In [0]:
reviews.Sue[reviews.Bob.isnull()]

Series([], Name: Sue, dtype: object)

## **notnull**

In [0]:
reviews.Sue[reviews.Bob.notnull()]

Product A      Pretty Good
Product B            Bland
Product C      I liked it.
Product D    It was awful.
Name: Sue, dtype: object

# **Assigning Data**

In [0]:
reviews['Dus'] = 'xyz'   ### add another column with default values 'xyz'
reviews

                     Bob            Sue  Dus
Product A    I liked it.    Pretty Good  xyz
Product B  It was awful.          Bland  xyz
Product C    I liked it.    I liked it.  xyz
Product D  It was awful.  It was awful.  xyz

or with an iterable values

In [0]:
reviews['Reverse_Ranl'] = range(len(reviews),0,-1)
reviews

                     Bob            Sue  Dus  Reverse_Ranl
Product A    I liked it.    Pretty Good  xyz             4
Product B  It was awful.          Bland  xyz             3
Product C    I liked it.    I liked it.  xyz             2
Product D  It was awful.  It was awful.  xyz             1